{
  "id": "yalantis",
  "position": "Senior Full-stack Software Engineer",
  "companyName": "Yalantis",
  "companyWebsite": "https://yalantis.com",
  "years": "12/2016 - 12/2018",
  "contentParagraphs": [
    "I have got solid experience in all aspects of the software lifecycle, including requirement analysis, estimation, planning, design, implementation, testing, deploying and maintaining.",
    "I have worked in tight cooperation with a mobile team rapidly and developed from scratch RESTful API applications with Admin interfaces. Also, I faced a lot of 3rd party integrations via APIs, such as Contentful, Slack, Trello, Facebook, Cloudflare, Google etc."
  ],
  "achievements": [
    "Integrated a wide range of third-party services and components like payment gateways, geo-location services, social media logins etc."
  ],
  "responsibilities": [
    "Develop and maintain web applications using Ruby, JavaScript, TypeScript and CoffeeScript",
    "Architect, design and develop new features, tools and complete applications, which are part of a complex service-oriented ecosystem",
    "Work with Rails, Node.js, React.js, or similar front-end frameworks.",
    "Estimate and prioritize items in development iterations and releases",
    "Work with the team to plan and own the features they build, including working with the team lead to scope out evaluation metrics beforehand and be accountable for hitting those metrics",
    "Participate in multiple code reviews, and become a go-to person for team code reviews"
  ],
  "technologies": [
    "amazon_ec2",
    "amazons3",
    "amazonsqs",
    "bitbucket",
    "bootstrap",
    "brakeman",
    "cancancan",
    "capistrano",
    "chartjs",
    "cloudflare",
    "coffeescript",
    "confluence",
    "cucumber",
    "datadog",
    "docker",
    "dotenv",
    "drawio",
    "facebook",
    "faker",
    "figma",
    "git",
    "github",
    "github_actions",
    "gitlab",
    "gnubash",
    "google",
    "google_maps",
    "graphql",
    "heroku",
    "html5",
    "intercom",
    "javascript",
    "jenkins",
    "jira",
    "jquery",
    "jwt",
    "mongodb",
    "mui",
    "mysql",
    "newrelic",
    "nginx",
    "postgresql",
    "postman",
    "pundit",
    "react_router",
    "reactjs",
    "redis",
    "redux",
    "resque",
    "rpush",
    "rspec",
    "rubocop",
    "ruby",
    "ruby_on_rails",
    "rubycritic",
    "salesforce",
    "sass",
    "shoulda_matchers",
    "sidekiq",
    "simplecov",
    "slack",
    "storybook",
    "swagger",
    "webpack",
    "websocket",
    "youtube"
  ]
}
