{
  "id": "apriorit",
  "position": "Project Team Lead / Senior Full-stack Engineer",
  "companyName": "Apriorit",
  "companyWebsite": "https://www.apriorit.com",
  "years": "01/2019 - 08/2019",
  "contentParagraphs": [
    "Worked on secure, flexible and adaptable identity and access management platform components with full software development cycle - requirements analysis, design, implementation, testing, deployment and technical support."
  ],
  "responsibilities": [
    "Coordinate teams and supervise the development process",
    "Perform the technical lead role overseeing the development of a multi-factor adaptive authentication and access management solution",
    "Supporting the goal of meeting scope, schedule, and delivery requirements",
    "Support recruiting efforts by evaluating assignments and assisting with interviews",
    "Keep the team focused on the project and moving toward reaching its goal - engage, motivate and take care of their needs and maintain a friendly and productive work environment",
    "High-level project road-map planning",
    "Providing technical expertise and guidance to team members. Assisting in problem-solving, code reviews, and architectural decisions",
    "Mentor and guide  junior software developers on design patterns and development best practices",
    "Document solutions by developing documentation, flowcharts, layouts, DB diagrams, charts, code comments, and clear testable code",
    "Participate in daily stand-ups, software design sessions, code reviews, and sprint retrospectives",
    "Translate Agile requirements into conceptual and detailed designs"
  ],
  "achievements": [
    "Successfully performed code audit to meet the SOC2 application certification. Audit included - Security, Availability, Processing Integrity, Confidentiality, Privacy",
    "Managed team with 6 developers in 3 projects for 1 client",
    "Oversaw the work of developers, actively participating in code reviews and providing constructive feedback. This commitment to code quality resulted in a more stable and reliable software product",
    "Organized product-specific domain UI design into the Design System using StoryBook",
    "Contributed over 30 new components to the in-house UI Storybook library to create reusable React components",
    "Handled multiple languages/frameworks development",
    "Led the integration of a new back-end data provider which saved the company $300K annually and reduced customer complaints by 4%"
  ],
  "technologies": [
    "amazon_document_db",
    "amazons3",
    "amazonsqs",
    "axios",
    "bitbucket",
    "brakeman",
    "chartjs",
    "checkmarx",
    "confluence",
    "csharp",
    "cypress",
    "datadog",
    "docker",
    "dotenv",
    "dotnet",
    "drawio",
    "elasticsearch",
    "faker",
    "figma",
    "git",
    "github",
    "gnubash",
    "graphql",
    "honeybadger",
    "html5",
    "intercom",
    "javascript",
    "jenkins",
    "jira",
    "jwt",
    "mobx",
    "nginx",
    "newrelic",
    "opsgenie",
    "postgresql",
    "postman",
    "react_router",
    "reactjs",
    "redis",
    "redux",
    "rpush",
    "rspec",
    "rubocop",
    "ruby",
    "ruby_grape",
    "ruby_on_rails",
    "ruby_sinatra",
    "sentry",
    "shoulda_matchers",
    "simplecov",
    "slack",
    "storybook",
    "swagger",
    "typescript",
    "webpack",
    "websocket"
  ]
}
