{
  "id": "sloboda-studio",
  "position": "Senior Full-stack Engineer / Project Technical Lead",
  "companyName": "Sloboda Studio",
  "companyWebsite": "https://sloboda-studio.com",
  "years": "08/2019 - 11/2020",
  "contentParagraphs": [
    "Worked on eight diverse projects across a wide range of industries. With a strong focus on delivering high-quality solutions, I have gained valuable experience in developing innovative software applications and contributing to successful project delivery."
  ],
  "responsibilities": [
    "Develop and maintain relationships with stakeholders, vendors, and other third parties",
    "Manage projects to deliver on time and under the budget",
    "Directly work closely with the customers on product development and provide product support",
    "Determining the underlying architecture for the software",
    "Bring technical expertise to solve hard problems, adapt to change, and leverage new technologies and best practices",
    "Drive and lead technical initiatives in software engineering processes to be up-to-date with the best practices",
    "Mentor coworkers through code review, pair programming, team collaboration, and training to improve collective knowledge and best practices",
    "Lead project teams and ensure effective communication and collaboration",
    "Pre-sale activities including kick-off meetings, requirement gathering and analysis, proposal preparation",
    "Improve company engineering standards, tooling, and processes"
  ],
  "achievements": [
    "Developed a lucid competency matrix to form better teams, identify gaps, and plan accordingly",
    "Simultaneously managed multiple projects, ensuring timely delivery and staying within budget constraints",
    "Coordinated teams of 6 programmers and provided hands-on supervision throughout the development process. Fostered a collaborative environment that improved team cohesion and productivity",
    "Collaborated with a team of developers to implement API security measures, resulting in a 40% reduction in security vulnerabilities and a 15% increase in overall API security",
    "Facilitated a positive onboarding experience, contributing to improved teamwork, early guidance, and seamless team integration. Got talent growth boost up to 23%",
    "Served as a technical adviser to both managers and clients, providing valuable insights that contributed to informed decision-making and overall project success",
    "Led requirement gathering and analysis efforts, streamlining the process to ensure a more comprehensive understanding of project needs",
    "Researched and evaluated new technologies to improve API performance, resulting in the implementation of a new caching system that improved API response time by 35%"
  ],
  "technologies": [
    "amazon_ec2",
    "amazons3",
    "applelogin",
    "applepay",
    "bitbucket",
    "bootstrap",
    "brakeman",
    "capistrano",
    "chartjs",
    "digitalocean",
    "docker",
    "dotenv",
    "drawio",
    "facebook",
    "faker",
    "ffmpeg",
    "figma",
    "git",
    "github",
    "github_actions",
    "gitlab",
    "gnubash",
    "google",
    "google_maps",
    "googlepay",
    "heroku",
    "honeybadger",
    "html5",
    "javascript",
    "jenkins",
    "jest",
    "jira",
    "jquery",
    "jwt",
    "logz_io",
    "mina",
    "mobx",
    "mui",
    "mysql",
    "nginx",
    "paypal",
    "postgresql",
    "postman",
    "pundit",
    "react_router",
    "reactjs",
    "redux",
    "resque",
    "rpush",
    "rspec",
    "rubocop",
    "ruby",
    "ruby_on_rails",
    "salesforce",
    "sass",
    "selenium",
    "sentry",
    "shoulda_matchers",
    "sidekiq",
    "simplecov",
    "slack",
    "storybook",
    "stripe",
    "swagger",
    "trello",
    "typescript",
    "webpack",
    "websocket",
    "x"
  ]
}
