{
  "id": "theskills",
  "position": "Technical Consultant / Senior Full-stack Engineer",
  "companyName": "The Skills",
  "companyWebsite": "https://theskills.com",
  "years": "04/2020 - 12/2021",
  "contentParagraphs": [
    "Acted as the Technical Consultant in a fully remote distributed team at the startup company for the video-based educational platform. The solution includes an administrator panel, customer web application, and REST API based on the Ruby On Rails / NextJs framework. Worked as a fullstack developer as part of a 4 people team on the solution for the marketing website using the NextJs framework.",
    "The Skills is an online sports education platform where athletes teach online courses in their field of expertise. The platform instructors are some of the most talented people in their fields. Unfortunately, many students never have the opportunity to use them for a variety of reasons. They believe that the convergence of these communities has asignificant impact on amplifying the voice of, and adding value to, all members. The Skill aims to help transfer knowledge and insights from its instructors to learners and across the community as a whole."
  ],
  "responsibilities": [
    "Collaborate with designers, product managers, and engineers to design, implement, and iterate on features and product directions",
    "Write maintainable, clean, well-architected code, tests, and documentation",
    "Participate in code reviews and design reviews to ensure quality and good architecture",
    "Estimate and complete tasks development including requirements gathering, analysis, and coding, with feedback and guidance from the product team",
    "Oversee the work of team members, conduct code reviews, and help colleagues troubleshoot code issues",
    "3rd party services integration",
    "Data storage modeling and architecture",
    "Architect and implement API endpoints",
    "Be part of a small team of developers that value high-quality software, practice continuous improvement, inspire collaboration, and believe in rapid iterative development"
  ],
  "achievements": [
    "The client has raised a total of $4.9M in funding",
    "Engaged in the full product development lifecycle: from ideation through implementation to ongoing enhancement",
    "Managed a small team of internal and offshore developers ensuring tasks are delegated accordingly and timelines are met.",
    "Crafted robust architecture that ensure unrivaled scalability, maintainability, and overall performance for your projects",
    "Reduced development time, increased stability, and enhanced scalability through modular application architecture integration",
    "Built video content delivery solution based on the Brightcove platform",
    "Integrated Stripe/PayPal payment processors. In addition integrated Apple/Android In-App purchases for the mobile applications",
    "Created and maintained API versioning, resulting in a 20% reduction in API errors and a 15% increase in developers productivity",
    "Developed and maintained Swagger API documentation and specifications, resulting in a 20% increase in developer productivity and a 10% reduction in API errors.",
    "Achieved high-quality codebase with 87% of test coverage using RSpec",
    "Created end-to-end automated testing to ensure data quality which ultimately reduced error rate by over 10%"
  ],
  "technologies": [
    "amazons3",
    "amazonsqs",
    "applelogin",
    "applepay",
    "awslambda",
    "axios",
    "bootstrap",
    "brakeman",
    "brightcove",
    "clickup",
    "contentful",
    "docker",
    "dotenv",
    "drawio",
    "facebook",
    "faker",
    "ffmpeg",
    "figma",
    "git",
    "github",
    "github_actions",
    "gnubash",
    "google",
    "googlepay",
    "googletagmanager",
    "graphql",
    "heroku",
    "html5",
    "javascript",
    "jest",
    "jquery",
    "jwt",
    "nextdotjs",
    "nginx",
    "nodedotjs",
    "paypal",
    "postgresql",
    "postman",
    "prisma",
    "reactjs",
    "redux",
    "rpush",
    "rspec",
    "rubocop",
    "ruby",
    "ruby_on_rails",
    "sass",
    "selenium",
    "sentry",
    "sequelize",
    "shoulda_matchers",
    "sidekiq",
    "simplecov",
    "slack",
    "storybook",
    "stripe",
    "swagger",
    "typescript",
    "vercel",
    "webpack",
    "x"
  ]
}
